#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.storage_layer.random_password.password: Refreshing state... [id=none]
module.vault_layer.data.azurerm_client_config.current_client: Reading...
module.storage_layer.data.azurerm_client_config.client_db: Reading...
module.vault_layer.data.azurerm_client_config.current_client: Read complete after 0s [id=2022-07-10 22:28:23.09673774 +0000 UTC]
module.storage_layer.data.azurerm_client_config.client_db: Read complete after 0s [id=2022-07-10 22:28:23.097622253 +0000 UTC]
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core]
module.vault_layer.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.KeyVault/vaults/kv-dev-sunrise-core]
module.ingest_layer.azurerm_storage_account.sa: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Storage/storageAccounts/sadevingest]
module.ingest_layer.azurerm_app_service_plan.asp: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Web/serverfarms/asp-dev-ingest-sunrise-core]
module.storage_layer.azurerm_mssql_server.sqlserver: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core]
module.ingest_layer.azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Insights/components/appi-dev-ingest-sunrise-core]
module.storage_layer.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Storage/storageAccounts/dldstore]
module.storage_layer.azurerm_mssql_database.sqldatabase: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Sql/servers/sql-dev-sunrise-core/databases/db_dev_sunrise]
module.vault_layer.azurerm_key_vault_secret.secret_sql_admin: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin/eb68e3647e5d46bea1f54749240540cc]
module.vault_layer.azurerm_key_vault_secret.secret_sql_admin_pass: Refreshing state... [id=https://kv-dev-sunrise-core.vault.azure.net/secrets/secret-dev-sunrise-core-mssql-admin-pass/7589242675b4420d9f8da90aa6ca021d]
module.base_layer.azurerm_eventgrid_system_topic.system_topic: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.EventGrid/systemTopics/eg-system-topic-dev-sunrise-core]
module.ingest_layer.azurerm_function_app.function: Refreshing state... [id=/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Web/sites/func-dev-ingest-sunrise-core]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.compute_transform.azurerm_app_service_plan.asp will be created
  + resource "azurerm_app_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = "functionapp"
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "asp-dev-compute-transform-sunrise-core"
      + reserved                     = true
      + resource_group_name          = "rg-dev-sunrise-core"

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.compute_transform.azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "appi-dev-compute-transform-sunrise-core"
      + resource_group_name                   = "rg-dev-sunrise-core"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # module.compute_transform.azurerm_function_app.function will be created
  + resource "azurerm_function_app" "function" {
      + app_service_plan_id             = (known after apply)
      + app_settings                    = (known after apply)
      + client_affinity_enabled         = (known after apply)
      + custom_domain_verification_id   = (known after apply)
      + default_hostname                = (known after apply)
      + enable_builtin_logging          = true
      + enabled                         = true
      + https_only                      = true
      + id                              = (known after apply)
      + key_vault_reference_identity_id = (known after apply)
      + kind                            = (known after apply)
      + location                        = "westeurope"
      + name                            = "func-dev-compute-transform-sunrise-core"
      + os_type                         = "linux"
      + outbound_ip_addresses           = (known after apply)
      + possible_outbound_ip_addresses  = (known after apply)
      + resource_group_name             = "rg-dev-sunrise-core"
      + site_credential                 = (known after apply)
      + storage_account_access_key      = (sensitive value)
      + storage_account_name            = "sadevcomputetransform"
      + storage_connection_string       = (sensitive value)
      + tags                            = {
          + "env"      = "dev"
          + "use_case" = "sunrise-core"
        }
      + version                         = "~3"

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + site_config {
          + always_on                        = (known after apply)
          + app_scale_limit                  = (known after apply)
          + auto_swap_slot_name              = (known after apply)
          + dotnet_framework_version         = (known after apply)
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + health_check_path                = (known after apply)
          + http2_enabled                    = (known after apply)
          + ip_restriction                   = (known after apply)
          + java_version                     = (known after apply)
          + linux_fx_version                 = (known after apply)
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = (known after apply)
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = (known after apply)
          + use_32_bit_worker_process        = (known after apply)
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }
    }

  # module.compute_transform.azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_blob_public_access          = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_0"
      + name                              = "sadevcomputetransform"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "rg-dev-sunrise-core"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + customer_managed_key {
          + key_vault_key_id          = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.ingest_layer.azurerm_function_app.function will be updated in-place
  ~ resource "azurerm_function_app" "function" {
      ~ app_settings                    = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change. The value is unchanged.
          ~ "APPINSIGHTS_INSTRUMENTATIONKEY"  = (sensitive)
            # (8 unchanged elements hidden)
        }
        id                              = "/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.Web/sites/func-dev-ingest-sunrise-core"
        name                            = "func-dev-ingest-sunrise-core"
      ~ tags                            = {
          + "env"                                            = "dev"
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=6c20e3ce-c3f1-4e50-bef4-07f15e251573;IngestionEndpoint=https://westeurope-4.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "6c20e3ce-c3f1-4e50-bef4-07f15e251573" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/microsoft.insights/components/appi-dev-ingest-sunrise-core" -> null
          + "use_case"                                       = "sunrise-core"
        }
        # (21 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # module.vault_layer.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          ~ {
              ~ key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                  + "create",
                  + "get",
                ]
              ~ secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  + "set",
                  + "get",
                  + "delete",
                  + "list",
                  + "purge",
                  + "recover",
                ]
                # (5 unchanged elements hidden)
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                  - "Rotate",
                ]
              - object_id               = "5e9a9948-39af-4b46-aa09-9f03f821797e"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "22e1763f-3ff7-4e44-ac06-7ce3e6b059ef"
            },
          - {
              - application_id          = ""
              - certificate_permissions = []
              - key_permissions         = [
                  - "Create",
                  - "Get",
                ]
              - object_id               = "0f4d7a03-15e9-4550-884b-4a238f160fe9"
              - secret_permissions      = [
                  - "Set",
                  - "Get",
                  - "Delete",
                  - "List",
                  - "Purge",
                  - "Recover",
                ]
              - storage_permissions     = []
              - tenant_id               = "22e1763f-3ff7-4e44-ac06-7ce3e6b059ef"
            },
        ]
        id                              = "/subscriptions/3103978e-2404-4f33-9744-d9c686047bf8/resourceGroups/rg-dev-sunrise-core/providers/Microsoft.KeyVault/vaults/kv-dev-sunrise-core"
        name                            = "kv-dev-sunrise-core"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @fezepeda, Action: `pull_request`*